# Basic Sql Queries

In [1]:
import pandas as pd
import pandas.io.sql as sqlio
import psycopg2

conn = psycopg2.connect("dbname=northwind user=postgres password=password host=localhost port=5433")

![alt text](northwind.png "Title")

###  Display table of those products that are between the ages of 10 and 20

In [2]:
sql = """
SELECT "ProductName", "UnitPrice"
FROM products
WHERE "UnitPrice" BETWEEN 10 and 20
"""

data = sqlio.read_sql_query(sql, conn)
data.head()

     ProductName  UnitPrice
0           Chai      18.00
1          Chang      19.00
2  Aniseed Syrup      10.00
3   Genen Shouyu      13.00
4        Pavlova      17.45

### Display  the names of employees and sort by their Hire date from earliest to latest.

In [3]:
sql = """
SELECT "LastName", "FirstName", "HireDate"
FROM employees
ORDER BY "HireDate" 
"""

data = sqlio.read_sql_query(sql, conn)
data.head()

    LastName FirstName    HireDate
0  Leverling     Janet  1992-04-01
1    Davolio     Nancy  1992-05-01
2     Fuller    Andrew  1992-08-14
3    Peacock  Margaret  1993-05-03
4   Buchanan    Steven  1993-10-17